In [1]:
import pandas as pd
import numpy as np

In [11]:
data = {'kor':[10,30,50,70],'eng':[20,40,60,80],'math':[33,44,55,66]}
df = pd.DataFrame(data,index=['aa','bb','cc','dd'])
df

    kor  eng  math
aa   10   20    33
bb   30   40    44
cc   50   60    55
dd   70   80    66

### DataFrame의 인덱싱과 슬라이싱
* 인덱싱은 반드시 컬럼!!!
* 슬라이싱은 row를 반환함
* iloc 일 경우는 컬럼이나 row도 모두 zero based로 주어야 한다.
* 복수개의 연속되지 않은 row나 컬럼을 선택 할 경우 리스트를 이용한다.
* loc일 경우 부여된 인덱스를 사용해서 원하는 데이터를 추출한다.

In [6]:
# df['aa'] => 에러남 기본적으로 인덱스는 컬럼이다 그래서 다음과 같이 수정한다.
df['kor'] # 컬럼값을 주어야 하며 그 결과는 시리즈이다. 반드시 컬럼을 주어야 한다.

aa    10
bb    30
cc    50
dd    70
Name: kor, dtype: int64

In [7]:
df.kor #df['kor']  이거랑 같은 결과를 추출한다.

aa    10
bb    30
cc    50
dd    70
Name: kor, dtype: int64

In [10]:
# 컬럼값을 주어야 하며 그 결과는 시리즈이다. 반드시 컬럼을 주어야 한다.
df['eng'] # df.eng 와 같은 결과를 추출한다.

aa    20
bb    40
cc    60
dd    80
Name: eng, dtype: int64

In [13]:
# 복수개의 컬럼을 선택 할 경우 리스트로 인덱싱을 주면 된다. =>결과는 데이터프레임
df[['kor','math']]

    kor  math
aa   10    33
bb   30    44
cc   50    55
dd   70    66

In [15]:
# row 선택...
# 슬라이싱은 로우다
# 인덱싱은 반드시 컬럼으로 주고 슬라이싱은 row를 선택하여 결과를 반환한다.
df[0:3]

    kor  eng  math
aa   10   20    33
bb   30   40    44
cc   50   60    55

In [16]:
# 두번째 row부터 모든것을 선택하라
df[1:]

    kor  eng  math
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [17]:
# 부여된 인덱스로 슬라이싱을 한 경우
df['aa':'cc']

    kor  eng  math
aa   10   20    33
bb   30   40    44
cc   50   60    55

In [20]:
# iloc[] => zero based 인덱스를 이용하여 데이터 추출 => 결과값 시리즈
df.iloc[0]

kor     10
eng     20
math    33
Name: aa, dtype: int64

In [21]:
# loc[] => 부여된 인덱스를 주어야 한다. => 결과값이 2차원 이기 때문에 시리즈로 반환 
df.loc['aa']

kor     10
eng     20
math    33
Name: aa, dtype: int64

In [22]:
# 
df.iloc[1:4]

    kor  eng  math
bb   30   40    44
cc   50   60    55
dd   70   80    66

In [23]:
df.loc['bb':'cc']

    kor  eng  math
bb   30   40    44
cc   50   60    55

In [26]:
# df.iloc[1:,0] => 2번째 row부터 마지막 까지 추출하되 첫번째 컬럼의 결과값만
# 반환하라 => iloc 일 경우는 컬럼이나 row도 모두 zero based로 주어야 한다.
df.iloc[1:,0]

bb    30
cc    50
dd    70
Name: kor, dtype: int64

In [27]:
# df.iloc[1:,0:2] => 2번째 row부터 마지막 까지 추출하되 첫번째 컬럼과
# 두번째 컬럼의 결과값을 추출하라.
df.iloc[1:,0:2]

    kor  eng
bb   30   40
cc   50   60
dd   70   80

In [29]:
# 연속되지 않은 컬럼을 선택 할 경우 아래와 같이 사용한다.
# df.iloc[1:,0::2]
# 복수개의 컬럼을 선택할 경우 리스트로 묶어서 사용한다.
df.iloc[1:,[0,2]]

    kor  math
bb   30    44
cc   50    55
dd   70    66

In [30]:
# 복수개의 연속되지 않은 row를 선택 할 경우 리스트를 이용한다.
df.iloc[[0,3],[0,2]]

    kor  math
aa   10    33
dd   70    66

In [32]:
#df.loc['bb':,'eng':]=> 부여된 인덱스를 사용해서 원하는 데이터를 추출한다.
df.loc['bb':,'eng':]

    eng  math
bb   40    44
cc   60    55
dd   80    66

In [34]:
#f.loc['bb':'cc',['kor','math']]
df.loc[['bb','cc'],['kor','math']]

    kor  math
bb   30    44
cc   50    55